In [1]:
"""
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.
Features of DataFrame

    Potentially columns are of different types
    Size : Mutable
    Labeled axes (rows and columns)
    Can Perform Arithmetic operations on rows and columns

A pandas DataFrame can be created using the following constructor :
pandas.DataFrame( data, index, columns, dtype, copy)

Create DataFrame
A pandas DataFrame can be created using various inputs like :
    Lists
    dict
    Series
    Numpy ndarrays
    Another DataFrame

"""

'A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.\nFeatures of DataFrame\n\n    Potentially columns are of different types\n    Size : Mutable\n    Labeled axes (rows and columns)\n    Can Perform Arithmetic operations on rows and columns\n\nA pandas DataFrame can be created using the following constructor :\npandas.DataFrame( data, index, columns, dtype, copy)\n\nCreate DataFrame\nA pandas DataFrame can be created using various inputs like :\n    Lists\n    dict\n    Series\n    Numpy ndarrays\n    Another DataFrame\n\n'

In [9]:
import pandas as pd
import numpy as np

In [8]:
data=pd.DataFrame([1,2,3,4,5,6,7,8,9])
data

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [12]:
Arr=np.array([1,2,3,4,5])
pd.DataFrame(Arr)

   0
0  1
1  2
2  3
3  4
4  5

In [13]:
L=[[1,2,3],[2,3,4],[3,4,5]]
pd.DataFrame(L)

   0  1  2
0  1  2  3
1  2  3  4
2  3  4  5

In [16]:
data = [['Robin',26,45.34],['Kevin',25,78.5],['Curil',23,87.67]]
df=pd.DataFrame(data,columns=['Name','Age','Marks'])
df

    Name  Age  Marks
0  Robin   26  45.34
1  Kevin   25  78.50
2  Curil   23  87.67

In [19]:
df['Name']

0    Robin
1    Kevin
2    Curil
Name: Name, dtype: object

In [20]:
df['Name'].values

array(['Robin', 'Kevin', 'Curil'], dtype=object)

In [22]:
df.Name

0    Robin
1    Kevin
2    Curil
Name: Name, dtype: object

In [25]:
df[['Name','Marks']]

    Name  Marks
0  Robin  45.34
1  Kevin  78.50
2  Curil  87.67

### From Dict

In [40]:
data = {'Name':['Ayush', 'Priya', 'Kapil', 'Rohit','Karan'],'Age':[28,21,29,42,56]}
df=pd.DataFrame(data,index=['Rank1','Rank2','Rank3','Rank4','Rank5'])
df

        Name  Age
Rank1  Ayush   28
Rank2  Priya   21
Rank3  Kapil   29
Rank4  Rohit   42
Rank5  Karan   56

In [41]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data,index=['rank1','rank2'])
print (df)

       a   b     c
rank1  1   2   NaN
rank2  5  10  20.0

In [42]:
df = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])
print(df)

        a   b
first   1   2
second  5  10

In [43]:
df = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1','c2'])
print(df)

        a  b1  c2
first   1 NaN NaN
second  5 NaN NaN

In [44]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

In [45]:
df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4